{
  "navigation": "Navegação",
  "tecnologies": "Tecnologias",
  "journey": "Jornada",
  "my-skill": "Desenvolvedor Full-Stack",
  "about": "Sobre",
  "about-ispb-blog": "Com as minhas habilidades criei uma vitrine para a universidade",
  "end-about-ispb-blog": "para o meu portfólio, foi um projeto onde professores e cordenadores de cada faculdade poderiam publicar varias noticias sobre a universidade, eventos, etc. Os alunos poderiam acessar essas notícias e se manterem informados sobre tudo o que acontece na universidade. Onde eles podem interagir com as notícias, comentando, curtindo. O projeto foi desenvolvido com [[React|bold]], [[Next.js|bold]], [[Tailwindcss|bold]], [[Nodejs|bold]], [[Express|bold]], [[MongoDB|bold]] e hospedado na [[Vercel|blue|url:https://blog-of-university-ispb-frontend.vercel.app/]].",
  "home": "Página Inicial",
  "about-beauty-salon": "Desenvolvi um website para um salão de beleza na província de Benguela com o objetivo de fortalecer a presença digital do negócio e expandir os seus serviços para o ambiente online. A plataforma foi criada para divulgar os serviços oferecidos, apresentar informações de contacto, localização e horários de funcionamento, além de facilitar a comunicação com os clientes. O principal foco foi aumentar a visibilidade do salão na internet, atrair novos clientes e contribuir para o crescimento do negócio, o projeto foi desenvolvido com [[React|bold]], [[Next.js|bold]], [[Tailwindcss|bold]], [[Nodejs|bold]], [[Express|bold]], [[MongoDB|bold]] e hospedado na [[Vercel|blue|url:https://manage-beauty-salon-frontend-update.vercel.app/]].",
  "entrance-school": "Ingresso no Ensino Médio.",
  "started-logic": "Comecei a estudar Lógica de Programação.",
  "first-code": "Primeiros códigos da minha carreira.",
  "first-web": "Primeiro contato com a Web.",
  "javacript-course": "Fiz o curso de JavaScript.",
  "c#": " foi a primeira Linguagem de Programação da minha carreira foi boa a experiência pude aprender comandos voltado ao",
  "text-c#": "por meios dos estudos escolares.",
  "HTML-course": "curso",
  "and": "e",
  "first-javascript": "Então ficando encantado com as",
  "javascript-course2": "curso de JavaScript ",
  "created-ispb-blog": "Criei uma vitrine online para a universidade ISPB",
  "created-beauty-salon": "Criei um website para um salão de beleza.",

  "then": "voltadas a",
  "technologies": "tecnologias",
  "took": "fiz o",
  "created": "Crie um",
  "learned-jotai": "Aprendi Jotai.",
  "learned-mantine": "Aprendi Mantine.",
  "learned-tailwindcss": "Aprendi Tailwindcss.",
  "learned-next": "Comecei a estudar Next.",
  "created-my-portfolio": "Finalmente crie o meu Portfólio.",
  "financial-manager": "Gestor Financeiro",
  "about-financial-manager": "com outras tecnologias tornando o projeto mais elegante com a finalidade de melhorar as minhas habilidades nas tecnologias utilizadas.",
  "end-javascript": "no canal curso em video até agora o melhor que já fiz aprendi muito pode melhorar minhas habilidades e dar os meus primeiros passos na Linguagem. Sensacional me ajudou muito a minha maneira de pensar.",
  "text-try": "",
  "about-material-ui": "Sendo uma biblioteca de componentes do React bem popular dei uma chance ao",
  "skill-material-ui": "para aumentar as minhas habilidades.",
  "github": "Me cadastrei no GitHub.",
  "end-CRUD": "para fins de estudos.",
  "title-acha-5": "Acha-5",
  "about-react": "Desde então com o objeto de aumentar as minhas habilidades fiz o curso de ",
  "react": " no",
  "finished-school": "Terminei o Ensino Médio.",
  "first-typescript": "Primeiro contato com o Typescript.",
  "created-CRUD": "Crie um CRUD mais moderno.",
  "about-styled-components": "Aprendi Styled-Components.",
  "about-Material-UI": "Aprendi Material-UI.",
  "created-financial-manager": "Crie um gestor Financeiro.",
  "previous": "Anterior",
  "next": "Próximo",
  "reactdocs": "documentação do react.",
  "about-reactdocs": "Já entendendo o fluxo como o React funciona decidi ir mais a fundo na tecnologia estudando conceitos mais avançados na",
  "about-statistics-student": "Desenvolvi o projeto",
  "project-statistics-student": "Estatísticas dos Alunos",
  "proj-statistics-student": "para melhorar as minhas habilidades em React.",
  "origamid-channel": "canal da Origamid,",
  "end-origamid": "sendo hoje a minha habilidade principal. Sensacional me ajudou muito a minha maneira de pensar.",
  "react-course": "Fiz o curso de React.",
  "statistics-student": "Crie o projeto Estatisticas dos Alunos.",
  "deeply-react": "Aprofundei os meus conhecimentos em React na sua documentação.",
  "about-CRUD": "Sendo um projeto desafiador crie um ",
  "about-acha-5": "Para fins de melhorar as minhas habilidades fiz vários projetos como o",
  "CRUD": "Create um CRUD.",
  "appointment": "Agendamento",
  "cellphone": "Telefone",
  "acha-5": "Fiz o projeto Acha-5.",
  "text-after-try": "Foi bom tê-lo feito, lembro que na época, me ensinou a trabalhar com",
  "of-CSS": "do CSS,",
  "text-CSS": "antes desse curso não entendia muito bem essas propriedades.",
  "nowadays": "Hoje em dia já não recomendo esse curso,",
  "end-CSS": "Layout não eram realidade nessa época.",
  "sencod-HTML": "mas ainda precisava aprimorar no meu CSS, então dei uma chance pra esse",
  "first-HTML": "Mesmo já confortável com",
  "january": "Janeiro",
  "september": "Setembro",
  "years": "anos",
  "github-account": "Desde então passei a publicar os meus projetos no",
  "about-school": "Depois de uma jornada de 4 anos terminei o ensino médio no",
  "school": "[[Instituto Politécnico de Administração e Gestão da Catumbela (IPAG)|blue]]",
  "more-about-school": "tendo adquirido o grau como",

  "typescriptdocs": "documentação.",
  "second-typescript": "Finalmente dei uma chance ao",
  "about-typescript": "para melhorar o meu código tornando ele mais claro e seguro tipando o código ponta á ponta. Basicamente aprendi TypeScript na sua ",
  "my-course-degree": "[[Técnico médio de Informática de Gestão.|green]]",
  "this": "Este",
  "project-CRUD": "projeto (CRUD)",
  "about-project-CRUD": "foi desenvolvido especialmente para o teste de uma entrevista que fiz da empresa",
  "before-profile": "com a finalidade de conseguir uma vaga como",
  "full-stack-developer": "Desenvolvedor Full-Stack.",
  "styled-componentsdocs": "documentação.",
  "about-styled-componentsdocs": "Com a finalidade de melhorar as minhas habilidades no que toca aos estilos aprendi Styled-Components na sua",
  "year": "ano",
  "month": "mês",
  "february": "Fevereiro",
  "march": "Março",
  "august": "Agosto",
  "november": "Novembro",
  "april": "Abril",
  "december": "Desembro",
  "october": "Outubro",
  "start-c#": "Comecei a estudar C# na escola.",
  "may": "Maio",
  "june": "Junho",
  "july": "Julho",
  "first-jotai": "Já dominando",
  "about-my-portfolio": "Depois de ter adiado por alguns tempos finalmente desenvolvi o meu",
  "end-about-my-portfolio": "abordando a minha jornada, habilidades tudo a respeito do meu potencial.",
  "about-mantine": "Com a finalidade de aumentar nas minhas ferramentas de desenvolvimento voltadas aos estilos aprendi a biblioteca de componentes",
  "end-about-mantine": "foi sensecinal.",
  "about-jotai": "decide procurar outras maneiras de lidar com estados globais então estudai",
  "end-about-jotai": "que por mim é muito simples desde então uso ele em meus projetos.",
  "first-next": "Sabendo que é o framework do",
  "about-next": "mais querido da comunidade aprendi next na ",
  "about-tailwindcss": "é um framework de estilos bem interessante e simples de utilizar por tal motivo decidi estudar ele para ser mais umas das minhas habilidades.",
  "end-about-next": "Hoje em dia é a minha principal ferramenta de desenvolvimento que utilizo nos meus projetos.",
  "first-code-desc": "Desde então passei a fazer os exercícios proposto pelo curso acima referido e fui melhorando a minha maneira de pensar.",
  "start-journey": "Comecei a minha jornada no ensino médio no",
  "my-school": "curso de Informática de Gestão no Instituto Politécnico de Administração e Gestão da Catumbela (IPAG).",
  "first-studies": "Meu primeiro contato com a programação estudei no",
  "video-course": " canal curso em video",
  "video-course2": "sensacional me ajudou muito a minha maneira de pensar.",
  "start-journey2": " Foi no ensino médio que os meus sonhos começaram a ser construídos.",
  "vscode": "[[VS Code|blue]] - Editor de código que uso no meu dia a dia. O [[VS Code|yellow]] é com certeza o meu editor preferido.",
  "HTMLdesc": "[[HTML|yellow]] - Tudo começou por ele, nada seria possivel sem ele, o bom e velho [[HTML|yellow].",
  "photoshop": "Eu Domino apenas o básico está ferramenta utilizando especialmente para editar fotos.",
  "vercel": "[[Vercel|red]] - Utilizo a vercel para hospedar o meu front-end de uma forma simples e grátis.",
  "nodejs": "Depois de um bom tempo no front-end decidi mergulhar para o back-end aumentando minhas habilidade e estudar [[Node.js|green]], agora faz parte das minhas habilidades.",
  "insomnia": "[[Insomnia|violet]] - Utilizar o insomnia para testar minhas rotas no backend ganando tempo no desenvolvimento.",
  "phpmyadmin": "[[phpMyAdmin|yellow]] - Uma ferramenta legal que facilita o meu dia de desenvolvimento para manipular o meu banco de dados em mysql.",
  "postgres": "[[PostgreSQL|violet]] - Aprendi o postgres na minha jornada como full-stack é uns dos bancos de dados que utilizo.",
  "CSS3desc": "[[CSS3|blue]] - Linguagem de estilo que usei desde o começo da minha jornada. Hoje em dia utilizo várias tecnologias acima dele. Mas ainda assim o CSS é a tecnologia que mais utilizo no meu dia á dia.",
  "mongodb": "[[MongoDB|green]] - Sinceramente o mongodb é uns dos melhores bancos de dados que utilizo rápido e fácil de utiliza simplifica muito o meu dia a dia.",
  "mysql": "[[MySQL|blue]] - Aprendi o mysql na minha jornada como full-stack é uns dos bancos de dados que utilizo.",
  "express": "[[Express|green]] - Atualmente desenvolvo minhas aplicações com este framework e esta sendo muito legal para o desenvolvimento do backend principalmente pela sua fácil utilização.",
  "javascript": "[[JavaScript|yellow]] - A principal tecnologia da minha stack de desenvolvimento. Foi com [[JavaScript|yellow]] que criei o meu primeiro programa.",
  "typescript": "Depois do [[TypeScript|blue]] já não mais desenvolvo projetos com [[JavaScript|yellow]]. Antes não queria ouvir falar sobre tipagem, não me agradava em nada, hoje já não vivo sem.",
  "reactjs": "[[React|violet]] é sem sombra de dúvidas a melhor tecnológia que aprendi durante toda a minha jornada como desenvolvedor front-end.",
  "nextjs": "O [[Framework React|blue]] mais amado pela comunidade. O [[Next.js|yellow]] acabou se tornando a minha principal ferramente no desenvolvimento Web Front-End.",
  "contacts": "Contatos",
  "projects": "Projetos",
  "description": "Projetado e Desenvolvido por Pascoal Kahamba",
  "2023": "Todos os direitos reservados."
}
